/* automatically generated by rust-bindgen */

pub const _STDINT_H: ::std::os::raw::c_uint = 1;
pub const _FEATURES_H: ::std::os::raw::c_uint = 1;
pub const _DEFAULT_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC11: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC99: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC95: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX_IMPLICITLY: ::std::os::raw::c_uint = 1;
pub const _POSIX_SOURCE: ::std::os::raw::c_uint = 1;
pub const _POSIX_C_SOURCE: ::std::os::raw::c_uint = 200809;
pub const __USE_POSIX: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX2: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199309: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199506: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K8: ::std::os::raw::c_uint = 1;
pub const _ATFILE_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_MISC: ::std::os::raw::c_uint = 1;
pub const __USE_ATFILE: ::std::os::raw::c_uint = 1;
pub const __USE_FORTIFY_LEVEL: ::std::os::raw::c_uint = 0;
pub const _STDC_PREDEF_H: ::std::os::raw::c_uint = 1;
pub const __STDC_IEC_559__: ::std::os::raw::c_uint = 1;
pub const __STDC_IEC_559_COMPLEX__: ::std::os::raw::c_uint = 1;
pub const __STDC_ISO_10646__: ::std::os::raw::c_uint = 201505;
pub const __STDC_NO_THREADS__: ::std::os::raw::c_uint = 1;
pub const __GNU_LIBRARY__: ::std::os::raw::c_uint = 6;
pub const __GLIBC__: ::std::os::raw::c_uint = 2;

pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_char;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
extern "C" {
    pub fn TF_Version() -> *const ::std::os::raw::c_char;
}
pub const TF_DataType_TF_COMPLEX: TF_DataType = TF_DataType::TF_COMPLEX64;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum TF_DataType {
    TF_FLOAT = 1,
    TF_DOUBLE = 2,
    TF_INT32 = 3,
    TF_UINT8 = 4,
    TF_INT16 = 5,
    TF_INT8 = 6,
    TF_STRING = 7,
    TF_COMPLEX64 = 8,
    TF_INT64 = 9,
    TF_BOOL = 10,
    TF_QINT8 = 11,
    TF_QUINT8 = 12,
    TF_QINT32 = 13,
    TF_BFLOAT16 = 14,
    TF_QINT16 = 15,
    TF_QUINT16 = 16,
    TF_UINT16 = 17,
    TF_COMPLEX128 = 18,
    TF_HALF = 19,
    TF_RESOURCE = 20,
}
extern "C" {
    pub fn TF_DataTypeSize(dt: TF_DataType) -> usize;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum TF_Code {
    TF_OK = 0,
    TF_CANCELLED = 1,
    TF_UNKNOWN = 2,
    TF_INVALID_ARGUMENT = 3,
    TF_DEADLINE_EXCEEDED = 4,
    TF_NOT_FOUND = 5,
    TF_ALREADY_EXISTS = 6,
    TF_PERMISSION_DENIED = 7,
    TF_UNAUTHENTICATED = 16,
    TF_RESOURCE_EXHAUSTED = 8,
    TF_FAILED_PRECONDITION = 9,
    TF_ABORTED = 10,
    TF_OUT_OF_RANGE = 11,
    TF_UNIMPLEMENTED = 12,
    TF_INTERNAL = 13,
    TF_UNAVAILABLE = 14,
    TF_DATA_LOSS = 15,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TF_Status([u8; 0]);
extern "C" {
    pub fn TF_NewStatus() -> *mut TF_Status;
}
extern "C" {
    pub fn TF_DeleteStatus(arg1: *mut TF_Status);
}
extern "C" {
    pub fn TF_SetStatus(s: *mut TF_Status, code: TF_Code,
                        msg: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn TF_GetCode(s: *const TF_Status) -> TF_Code;
}
extern "C" {
    pub fn TF_Message(s: *const TF_Status) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct TF_Buffer {
    pub data: *const ::std::os::raw::c_void,
    pub length: usize,
    pub data_deallocator: ::std::option::Option<unsafe extern "C" fn(data:
                                                                         *mut ::std::os::raw::c_void,
                                                                     length:
                                                                         usize)>,
}
#[test]
fn bindgen_test_layout_TF_Buffer() {
    assert_eq!(::std::mem::size_of::<TF_Buffer>() , 24usize , concat ! (
               "Size of: " , stringify ! ( TF_Buffer ) ));
    assert_eq! (::std::mem::align_of::<TF_Buffer>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( TF_Buffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TF_Buffer ) ) . data as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TF_Buffer ) , "::" ,
                stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TF_Buffer ) ) . length as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TF_Buffer ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TF_Buffer ) ) . data_deallocator as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( TF_Buffer ) , "::" ,
                stringify ! ( data_deallocator ) ));
}
impl Clone for TF_Buffer {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn TF_NewBufferFromString(proto: *const ::std::os::raw::c_void,
                                  proto_len: usize) -> *mut TF_Buffer;
}
extern "C" {
    pub fn TF_NewBuffer() -> *mut TF_Buffer;
}
extern "C" {
    pub fn TF_DeleteBuffer(arg1: *mut TF_Buffer);
}
extern "C" {
    pub fn TF_GetBuffer(buffer: *mut TF_Buffer) -> TF_Buffer;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TF_Tensor([u8; 0]);
extern "C" {
    pub fn TF_NewTensor(arg1: TF_DataType, dims: *const i64,
                        num_dims: ::std::os::raw::c_int,
                        data: *mut ::std::os::raw::c_void, len: usize,
                        deallocator:
                            ::std::option::Option<unsafe extern "C" fn(data:
                                                                           *mut ::std::os::raw::c_void,
                                                                       len:
                                                                           usize,
                                                                       arg:
                                                                           *mut ::std::os::raw::c_void)>,
                        deallocator_arg: *mut ::std::os::raw::c_void)
     -> *mut TF_Tensor;
}
extern "C" {
    pub fn TF_AllocateTensor(arg1: TF_DataType, dims: *const i64,
                             num_dims: ::std::os::raw::c_int, len: usize)
     -> *mut TF_Tensor;
}
extern "C" {
    pub fn TF_DeleteTensor(arg1: *mut TF_Tensor);
}
extern "C" {
    pub fn TF_TensorType(arg1: *const TF_Tensor) -> TF_DataType;
}
extern "C" {
    pub fn TF_NumDims(arg1: *const TF_Tensor) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TF_Dim(tensor: *const TF_Tensor, dim_index: ::std::os::raw::c_int)
     -> i64;
}
extern "C" {
    pub fn TF_TensorByteSize(arg1: *const TF_Tensor) -> usize;
}
extern "C" {
    pub fn TF_TensorData(arg1: *const TF_Tensor)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn TF_StringEncode(src: *const ::std::os::raw::c_char, src_len: usize,
                           dst: *mut ::std::os::raw::c_char, dst_len: usize,
                           status: *mut TF_Status) -> usize;
}
extern "C" {
    pub fn TF_StringDecode(src: *const ::std::os::raw::c_char, src_len: usize,
                           dst: *mut *const ::std::os::raw::c_char,
                           dst_len: *mut usize, status: *mut TF_Status)
     -> usize;
}
extern "C" {
    pub fn TF_StringEncodedSize(len: usize) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TF_SessionOptions([u8; 0]);
extern "C" {
    pub fn TF_NewSessionOptions() -> *mut TF_SessionOptions;
}
extern "C" {
    pub fn TF_SetTarget(options: *mut TF_SessionOptions,
                        target: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn TF_SetConfig(options: *mut TF_SessionOptions,
                        proto: *const ::std::os::raw::c_void,
                        proto_len: usize, status: *mut TF_Status);
}
extern "C" {
    pub fn TF_DeleteSessionOptions(arg1: *mut TF_SessionOptions);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TF_Graph([u8; 0]);
extern "C" {
    pub fn TF_NewGraph() -> *mut TF_Graph;
}
extern "C" {
    pub fn TF_DeleteGraph(arg1: *mut TF_Graph);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TF_OperationDescription([u8; 0]);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TF_Operation([u8; 0]);
#[repr(C)]
#[derive(Debug, Copy)]
pub struct TF_Input {
    pub oper: *mut TF_Operation,
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_TF_Input() {
    assert_eq!(::std::mem::size_of::<TF_Input>() , 16usize , concat ! (
               "Size of: " , stringify ! ( TF_Input ) ));
    assert_eq! (::std::mem::align_of::<TF_Input>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( TF_Input ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TF_Input ) ) . oper as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TF_Input ) , "::" ,
                stringify ! ( oper ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TF_Input ) ) . index as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TF_Input ) , "::" ,
                stringify ! ( index ) ));
}
impl Clone for TF_Input {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct TF_Output {
    pub oper: *mut TF_Operation,
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_TF_Output() {
    assert_eq!(::std::mem::size_of::<TF_Output>() , 16usize , concat ! (
               "Size of: " , stringify ! ( TF_Output ) ));
    assert_eq! (::std::mem::align_of::<TF_Output>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( TF_Output ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TF_Output ) ) . oper as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TF_Output ) , "::" ,
                stringify ! ( oper ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TF_Output ) ) . index as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TF_Output ) , "::" ,
                stringify ! ( index ) ));
}
impl Clone for TF_Output {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn TF_GraphSetTensorShape(graph: *mut TF_Graph, output: TF_Output,
                                  dims: *const i64,
                                  num_dims: ::std::os::raw::c_int,
                                  status: *mut TF_Status);
}
extern "C" {
    pub fn TF_GraphGetTensorNumDims(graph: *mut TF_Graph, output: TF_Output,
                                    status: *mut TF_Status)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TF_GraphGetTensorShape(graph: *mut TF_Graph, output: TF_Output,
                                  dims: *mut i64,
                                  num_dims: ::std::os::raw::c_int,
                                  status: *mut TF_Status);
}
extern "C" {
    pub fn TF_NewOperation(graph: *mut TF_Graph,
                           op_type: *const ::std::os::raw::c_char,
                           oper_name: *const ::std::os::raw::c_char)
     -> *mut TF_OperationDescription;
}
extern "C" {
    pub fn TF_SetDevice(desc: *mut TF_OperationDescription,
                        device: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn TF_AddInput(desc: *mut TF_OperationDescription, input: TF_Output);
}
extern "C" {
    pub fn TF_AddInputList(desc: *mut TF_OperationDescription,
                           inputs: *const TF_Output,
                           num_inputs: ::std::os::raw::c_int);
}
extern "C" {
    pub fn TF_AddControlInput(desc: *mut TF_OperationDescription,
                              input: *mut TF_Operation);
}
extern "C" {
    pub fn TF_ColocateWith(desc: *mut TF_OperationDescription,
                           op: *mut TF_Operation);
}
extern "C" {
    pub fn TF_SetAttrString(desc: *mut TF_OperationDescription,
                            attr_name: *const ::std::os::raw::c_char,
                            value: *const ::std::os::raw::c_void,
                            length: usize);
}
extern "C" {
    pub fn TF_SetAttrStringList(desc: *mut TF_OperationDescription,
                                attr_name: *const ::std::os::raw::c_char,
                                values: *const *const ::std::os::raw::c_void,
                                lengths: *const usize,
                                num_values: ::std::os::raw::c_int);
}
extern "C" {
    pub fn TF_SetAttrInt(desc: *mut TF_OperationDescription,
                         attr_name: *const ::std::os::raw::c_char,
                         value: i64);
}
extern "C" {
    pub fn TF_SetAttrIntList(desc: *mut TF_OperationDescription,
                             attr_name: *const ::std::os::raw::c_char,
                             values: *const i64,
                             num_values: ::std::os::raw::c_int);
}
extern "C" {
    pub fn TF_SetAttrFloat(desc: *mut TF_OperationDescription,
                           attr_name: *const ::std::os::raw::c_char,
                           value: f32);
}
extern "C" {
    pub fn TF_SetAttrFloatList(desc: *mut TF_OperationDescription,
                               attr_name: *const ::std::os::raw::c_char,
                               values: *const f32,
                               num_values: ::std::os::raw::c_int);
}
extern "C" {
    pub fn TF_SetAttrBool(desc: *mut TF_OperationDescription,
                          attr_name: *const ::std::os::raw::c_char,
                          value: ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn TF_SetAttrBoolList(desc: *mut TF_OperationDescription,
                              attr_name: *const ::std::os::raw::c_char,
                              values: *const ::std::os::raw::c_uchar,
                              num_values: ::std::os::raw::c_int);
}
extern "C" {
    pub fn TF_SetAttrType(desc: *mut TF_OperationDescription,
                          attr_name: *const ::std::os::raw::c_char,
                          value: TF_DataType);
}
extern "C" {
    pub fn TF_SetAttrTypeList(desc: *mut TF_OperationDescription,
                              attr_name: *const ::std::os::raw::c_char,
                              values: *const TF_DataType,
                              num_values: ::std::os::raw::c_int);
}
extern "C" {
    pub fn TF_SetAttrShape(desc: *mut TF_OperationDescription,
                           attr_name: *const ::std::os::raw::c_char,
                           dims: *const i64, num_dims: ::std::os::raw::c_int);
}
extern "C" {
    pub fn TF_SetAttrShapeList(desc: *mut TF_OperationDescription,
                               attr_name: *const ::std::os::raw::c_char,
                               dims: *const *const i64,
                               num_dims: *const ::std::os::raw::c_int,
                               num_shapes: ::std::os::raw::c_int);
}
extern "C" {
    pub fn TF_SetAttrTensorShapeProto(desc: *mut TF_OperationDescription,
                                      attr_name:
                                          *const ::std::os::raw::c_char,
                                      proto: *const ::std::os::raw::c_void,
                                      proto_len: usize,
                                      status: *mut TF_Status);
}
extern "C" {
    pub fn TF_SetAttrTensorShapeProtoList(desc: *mut TF_OperationDescription,
                                          attr_name:
                                              *const ::std::os::raw::c_char,
                                          protos:
                                              *const *const ::std::os::raw::c_void,
                                          proto_lens: *const usize,
                                          num_shapes: ::std::os::raw::c_int,
                                          status: *mut TF_Status);
}
extern "C" {
    pub fn TF_SetAttrTensor(desc: *mut TF_OperationDescription,
                            attr_name: *const ::std::os::raw::c_char,
                            value: *mut TF_Tensor, status: *mut TF_Status);
}
extern "C" {
    pub fn TF_SetAttrTensorList(desc: *mut TF_OperationDescription,
                                attr_name: *const ::std::os::raw::c_char,
                                values: *const *const TF_Tensor,
                                num_values: ::std::os::raw::c_int,
                                status: *mut TF_Status);
}
extern "C" {
    pub fn TF_SetAttrValueProto(desc: *mut TF_OperationDescription,
                                attr_name: *const ::std::os::raw::c_char,
                                proto: *const ::std::os::raw::c_void,
                                proto_len: usize, status: *mut TF_Status);
}
extern "C" {
    pub fn TF_FinishOperation(desc: *mut TF_OperationDescription,
                              status: *mut TF_Status) -> *mut TF_Operation;
}
extern "C" {
    pub fn TF_OperationName(oper: *mut TF_Operation)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TF_OperationOpType(oper: *mut TF_Operation)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TF_OperationDevice(oper: *mut TF_Operation)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TF_OperationNumOutputs(oper: *mut TF_Operation)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TF_OperationOutputType(oper_out: TF_Output) -> TF_DataType;
}
extern "C" {
    pub fn TF_OperationOutputListLength(oper: *mut TF_Operation,
                                        arg_name:
                                            *const ::std::os::raw::c_char,
                                        status: *mut TF_Status)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TF_OperationNumInputs(oper: *mut TF_Operation)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TF_OperationInputType(oper_in: TF_Input) -> TF_DataType;
}
extern "C" {
    pub fn TF_OperationInputListLength(oper: *mut TF_Operation,
                                       arg_name:
                                           *const ::std::os::raw::c_char,
                                       status: *mut TF_Status)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TF_OperationInput(oper_in: TF_Input) -> TF_Output;
}
extern "C" {
    pub fn TF_OperationOutputNumConsumers(oper_out: TF_Output)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TF_OperationOutputConsumers(oper_out: TF_Output,
                                       consumers: *mut TF_Input,
                                       max_consumers: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TF_OperationNumControlInputs(oper: *mut TF_Operation)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TF_OperationGetControlInputs(oper: *mut TF_Operation,
                                        control_inputs:
                                            *mut *mut TF_Operation,
                                        max_control_inputs:
                                            ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TF_OperationNumControlOutputs(oper: *mut TF_Operation)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TF_OperationGetControlOutputs(oper: *mut TF_Operation,
                                         control_outputs:
                                             *mut *mut TF_Operation,
                                         max_control_outputs:
                                             ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum TF_AttrType {
    TF_ATTR_STRING = 0,
    TF_ATTR_INT = 1,
    TF_ATTR_FLOAT = 2,
    TF_ATTR_BOOL = 3,
    TF_ATTR_TYPE = 4,
    TF_ATTR_SHAPE = 5,
    TF_ATTR_TENSOR = 6,
    TF_ATTR_PLACEHOLDER = 7,
    TF_ATTR_FUNC = 8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct TF_AttrMetadata {
    pub is_list: ::std::os::raw::c_uchar,
    pub list_size: i64,
    pub type_: TF_AttrType,
    pub total_size: i64,
}
#[test]
fn bindgen_test_layout_TF_AttrMetadata() {
    assert_eq!(::std::mem::size_of::<TF_AttrMetadata>() , 32usize , concat ! (
               "Size of: " , stringify ! ( TF_AttrMetadata ) ));
    assert_eq! (::std::mem::align_of::<TF_AttrMetadata>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( TF_AttrMetadata ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TF_AttrMetadata ) ) . is_list as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TF_AttrMetadata ) ,
                "::" , stringify ! ( is_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TF_AttrMetadata ) ) . list_size as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TF_AttrMetadata ) ,
                "::" , stringify ! ( list_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TF_AttrMetadata ) ) . type_ as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( TF_AttrMetadata ) ,
                "::" , stringify ! ( type_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TF_AttrMetadata ) ) . total_size as *
